spec/dummy/app/controllers/lessons_controller.rb

  def update
    lesson = @student.lessons.find(params[:id])
    lesson.title = 'Title After'
    lesson.save
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."student_id" = 1 AND "lessons"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "lessons" SET "title" = 'Title After', "updated_at" = '2014-08-01 06:46:30.954867' WHERE "lessons"."id" = 1

  def find_student
    @student = Student.find(params[:student_id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]